InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/Core/MPU/Header/Peripheral/Register/MPU_RegisterDefines.h
#define MPU_RASR2_SRD1_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR2_SRD1_EN          ((uint32_t)0x00000000u)
#define MPU_RASR2_SRD1_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD2_MASK      ((uint32_t)0x00000400u)
#define MPU_RASR2_R_SRD2_BIT       (10u)
#define MPU_RASR2_R_SRD2_EN           ((uint32_t)0x00000000u)
#define MPU_RASR2_R_SRD2_DIS       ((uint32_t)0x00000400u)

#define MPU_RASR2_SRD2_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR2_SRD2_EN          ((uint32_t)0x00000000u)
#define MPU_RASR2_SRD2_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD3_MASK      ((uint32_t)0x00000800u)
#define MPU_RASR2_R_SRD3_BIT       (11u)
#define MPU_RASR2_R_SRD3_EN           ((uint32_t)0x00000000u)
#define MPU_RASR2_R_SRD3_DIS       ((uint32_t)0x00000800u)

#define MPU_RASR2_SRD3_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR2_SRD3_EN          ((uint32_t)0x00000000u)
#define MPU_RASR2_SRD3_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD4_MASK      ((uint32_t)0x00001000u)
#define MPU_RASR2_R_SRD4_BIT       (12u)
#define MPU_RASR2_R_SRD4_EN           ((uint32_t)0x00000000u)
#define MPU_RASR2_R_SRD4_DIS       ((uint32_t)0x00001000u)

#define MPU_RASR2_SRD4_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR2_SRD4_EN          ((uint32_t)0x00000000u)
#define MPU_RASR2_SRD4_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD5_MASK      ((uint32_t)0x00002000u)
#define MPU_RASR2_R_SRD5_BIT       (13u)
#define MPU_RASR2_R_SRD5_EN           ((uint32_t)0x00000000u)
#define MPU_RASR2_R_SRD5_DIS       ((uint32_t)0x00002000u)

#define MPU_RASR2_SRD5_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR2_SRD5_EN          ((uint32_t)0x00000000u)
#define MPU_RASR2_SRD5_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD6_MASK      ((uint32_t)0x00004000u)
#define MPU_RASR2_R_SRD6_BIT       (14u)
#define MPU_RASR2_R_SRD6_EN           ((uint32_t)0x00000000u)
#define MPU_RASR2_R_SRD6_DIS       ((uint32_t)0x00004000u)

#define MPU_RASR2_SRD6_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR2_SRD6_EN          ((uint32_t)0x00000000u)
#define MPU_RASR2_SRD6_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR2_R_SRD7_MASK      ((uint32_t)0x00008000u)
#define MPU_RASR2_R_SRD7_BIT       (15u)
#define MPU_RASR2_R_SRD7_EN           ((uint32_t)0x00000000u)
#define MPU_RASR2_R_SRD7_DIS       ((uint32_t)0x00008000u)

#define MPU_RASR2_SRD7_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR2_SRD7_EN          ((uint32_t)0x00000000u)
#define MPU_RASR2_SRD7_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR2_R_B_MASK      ((uint32_t)0x00010000u)
#define MPU_RASR2_R_B_BIT       (16u)
#define MPU_RASR2_R_B_DIS       ((uint32_t)0x00000000u)
#define MPU_RASR2_R_B_EN        ((uint32_t)0x00010000u)

#define MPU_RASR2_B_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR2_B_DIS         ((uint32_t)0x00000000u)
#define MPU_RASR2_B_EN          ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR2_R_C_MASK      ((uint32_t)0x00020000u)
#define MPU_RASR2_R_C_BIT       (17u)
#define MPU_RASR2_R_C_DIS       ((uint32_t)0x00000000u)
#define MPU_RASR2_R_C_EN        ((uint32_t)0x00020000u)

#define MPU_RASR2_C_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR2_C_DIS         ((uint32_t)0x00000000u)
#define MPU_RASR2_C_EN          ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR2_R_S_MASK      ((uint32_t)0x00040000u)
#define MPU_RASR2_R_S_BIT       (18u)
#define MPU_RASR2_R_S_DIS       ((uint32_t)0x00000000u)
#define MPU_RASR2_R_S_EN        ((uint32_t)0x00040000u)

#define MPU_RASR2_S_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR2_S_DIS         ((uint32_t)0x00000000u)
#define MPU_RASR2_S_EN          ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR2_R_TEX_MASK      ((uint32_t)0x00380000u)
#define MPU_RASR2_R_TEX_BIT       (19u)
#define MPU_RASR2_R_TEX_NC        ((uint32_t)0x00000000u)
#define MPU_RASR2_R_TEX_WB_WRA    ((uint32_t)0x00080000u)
#define MPU_RASR2_R_TEX_WT_NWA    ((uint32_t)0x00100000u)
#define MPU_RASR2_R_TEX_WB_NWA    ((uint32_t)0x00180000u)

#define MPU_RASR2_TEX_MASK        ((uint32_t)0x00000007u)
#define MPU_RASR2_TEX_NC          ((uint32_t)0x00000000u)
#define MPU_RASR2_TEX_WB_WRA      ((uint32_t)0x00000001u)
#define MPU_RASR2_TEX_WT_NWA      ((uint32_t)0x00000002u)
#define MPU_RASR2_TEX_WB_NWA      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define MPU_RASR2_R_AP_MASK      ((uint32_t)0x07000000u)
#define MPU_RASR2_R_AP_BIT       (24u)
#define MPU_RASR2_R_AP_NANA      ((uint32_t)0x00000000u)
#define MPU_RASR2_R_AP_RWNA      ((uint32_t)0x01000000u)
#define MPU_RASR2_R_AP_RWRO      ((uint32_t)0x02000000u)
#define MPU_RASR2_R_AP_RWRW      ((uint32_t)0x03000000u)
#define MPU_RASR2_R_AP_RONA      ((uint32_t)0x05000000u)
#define MPU_RASR2_R_AP_RORO      ((uint32_t)0x06000000u)

#define MPU_RASR2_AP_MASK      ((uint32_t)0x00000007u)
#define MPU_RASR2_AP_NANA      ((uint32_t)0x00000000u)
#define MPU_RASR2_AP_RWNA      ((uint32_t)0x00000001u)
#define MPU_RASR2_AP_RWRO      ((uint32_t)0x00000002u)
#define MPU_RASR2_AP_RWRW      ((uint32_t)0x00000003u)
#define MPU_RASR2_AP_RONA      ((uint32_t)0x00000005u)
#define MPU_RASR2_AP_RORO      ((uint32_t)0x00000006u)
/*--------*/

/*--------*/
#define MPU_RASR2_R_XN_MASK      ((uint32_t)0x10000000u)
#define MPU_RASR2_R_XN_BIT       (28u)
#define MPU_RASR2_R_XN_DIS       ((uint32_t)0x00000000u)
#define MPU_RASR2_R_XN_EN        ((uint32_t)0x10000000u)

#define MPU_RASR2_XN_MASK       ((uint32_t)0x00000001u)
#define MPU_RASR2_XN_DIS        ((uint32_t)0x00000000u)
#define MPU_RASR2_XN_EN         ((uint32_t)0x00000001u)
/*--------*/

/**********************************************************************************************
**************************************10 RBAR3 ***********************************************
**********************************************************************************************/

/*--------*/
#define MPU_RBAR3_R_REGION_MASK      ((uint32_t)0x0000000Fu)
#define MPU_RBAR3_R_REGION_BIT       (0u)
#define MPU_RBAR3_R_REGION_REG0      ((uint32_t)0x00000000u)
#define MPU_RBAR3_R_REGION_REG1      ((uint32_t)0x00000001u)
#define MPU_RBAR3_R_REGION_REG2      ((uint32_t)0x00000002u)
#define MPU_RBAR3_R_REGION_REG3      ((uint32_t)0x00000003u)
#define MPU_RBAR3_R_REGION_REG4      ((uint32_t)0x00000004u)
#define MPU_RBAR3_R_REGION_REG5      ((uint32_t)0x00000005u)
#define MPU_RBAR3_R_REGION_REG6      ((uint32_t)0x00000006u)
#define MPU_RBAR3_R_REGION_REG7      ((uint32_t)0x00000007u)
#define MPU_RBAR3_R_REGION_REG8      ((uint32_t)0x00000008u)
#define MPU_RBAR3_R_REGION_REG9      ((uint32_t)0x00000009u)
#define MPU_RBAR3_R_REGION_REG10     ((uint32_t)0x0000000Au)
#define MPU_RBAR3_R_REGION_REG11     ((uint32_t)0x0000000Bu)
#define MPU_RBAR3_R_REGION_REG12     ((uint32_t)0x0000000Cu)
#define MPU_RBAR3_R_REGION_REG13     ((uint32_t)0x0000000Du)
#define MPU_RBAR3_R_REGION_REG14     ((uint32_t)0x0000000Eu)
#define MPU_RBAR3_R_REGION_REG15     ((uint32_t)0x0000000Fu)

#define MPU_RBAR3_REGION_MASK        ((uint32_t)0x0000000Fu)
#define MPU_RBAR3_REGION_REG0        ((uint32_t)0x00000000u)
#define MPU_RBAR3_REGION_REG1        ((uint32_t)0x00000001u)
#define MPU_RBAR3_REGION_REG2        ((uint32_t)0x00000002u)
#define MPU_RBAR3_REGION_REG3        ((uint32_t)0x00000003u)
#define MPU_RBAR3_REGION_REG4        ((uint32_t)0x00000004u)
#define MPU_RBAR3_REGION_REG5        ((uint32_t)0x00000005u)
#define MPU_RBAR3_REGION_REG6        ((uint32_t)0x00000006u)
#define MPU_RBAR3_REGION_REG7        ((uint32_t)0x00000007u)
#define MPU_RBAR3_REGION_REG8        ((uint32_t)0x00000008u)
#define MPU_RBAR3_REGION_REG9        ((uint32_t)0x00000009u)
#define MPU_RBAR3_REGION_REG10       ((uint32_t)0x0000000Au)
#define MPU_RBAR3_REGION_REG11       ((uint32_t)0x0000000Bu)
#define MPU_RBAR3_REGION_REG12       ((uint32_t)0x0000000Cu)
#define MPU_RBAR3_REGION_REG13       ((uint32_t)0x0000000Du)
#define MPU_RBAR3_REGION_REG14       ((uint32_t)0x0000000Eu)
#define MPU_RBAR3_REGION_REG15       ((uint32_t)0x0000000Fu)
/*--------*/

/*--------*/
#define MPU_RBAR3_R_VALID_MASK      ((uint32_t)0x00000010u)
#define MPU_RBAR3_R_VALID_BIT       (4u)
#define MPU_RBAR3_R_VALID_DIS       ((uint32_t)0x00000000u)
#define MPU_RBAR3_R_VALID_EN        ((uint32_t)0x00000010u)

#define MPU_RBAR3_VALID_MASK        ((uint32_t)0x00000001u)
#define MPU_RBAR3_VALID_DIS         ((uint32_t)0x00000000u)
#define MPU_RBAR3_VALID_EN          ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RBAR3_R_ADDR_MASK      ((uint32_t)0xFFFFFFE0u)
#define MPU_RBAR3_R_ADDR_BIT       (5u)

