InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/Core/MPU/Header/Peripheral/Register/MPU_RegisterDefines.h
#define MPU_RBAR3_ADDR_MASK        ((uint32_t)0x01FFFFFFu)
/*--------*/

/**********************************************************************************************
**************************************11 RASR3 ***********************************************
**********************************************************************************************/

/*--------*/
#define MPU_RASR3_R_ENABLE_MASK      ((uint32_t)0x00000001u)
#define MPU_RASR3_R_ENABLE_BIT       (0u)
#define MPU_RASR3_R_ENABLE_DIS       ((uint32_t)0x00000000u)
#define MPU_RASR3_R_ENABLE_EN        ((uint32_t)0x00000001u)

#define MPU_RASR3_ENABLE_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR3_ENABLE_DIS         ((uint32_t)0x00000000u)
#define MPU_RASR3_ENABLE_EN          ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SIZE_MASK      ((uint32_t)0x0000003Eu)
#define MPU_RASR3_R_SIZE_BIT       (1u)
#define MPU_RASR3_R_SIZE_32B       ((uint32_t)0x00000008u)
#define MPU_RASR3_R_SIZE_1KB       ((uint32_t)0x00000012u)
#define MPU_RASR3_R_SIZE_1MB       ((uint32_t)0x00000026u)
#define MPU_RASR3_R_SIZE_1GB       ((uint32_t)0x0000003Au)
#define MPU_RASR3_R_SIZE_4GB       ((uint32_t)0x0000003Eu)

#define MPU_RASR3_SIZE_MASK        ((uint32_t)0x0000001Fu)
#define MPU_RASR3_SIZE_32B         ((uint32_t)0x00000004u)
#define MPU_RASR3_SIZE_1KB         ((uint32_t)0x00000009u)
#define MPU_RASR3_SIZE_1MB         ((uint32_t)0x00000013u)
#define MPU_RASR3_SIZE_1GB         ((uint32_t)0x0000001Du)
#define MPU_RASR3_SIZE_4GB         ((uint32_t)0x0000001Fu)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD0_MASK      ((uint32_t)0x00000100u)
#define MPU_RASR3_R_SRD0_BIT       (8u)
#define MPU_RASR3_R_SRD0_EN           ((uint32_t)0x00000000u)
#define MPU_RASR3_R_SRD0_DIS       ((uint32_t)0x00000100u)

#define MPU_RASR3_SRD0_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR3_SRD0_EN          ((uint32_t)0x00000000u)
#define MPU_RASR3_SRD0_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD1_MASK      ((uint32_t)0x00000200u)
#define MPU_RASR3_R_SRD1_BIT       (9u)
#define MPU_RASR3_R_SRD1_EN           ((uint32_t)0x00000000u)
#define MPU_RASR3_R_SRD1_DIS       ((uint32_t)0x00000200u)

#define MPU_RASR3_SRD1_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR3_SRD1_EN          ((uint32_t)0x00000000u)
#define MPU_RASR3_SRD1_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD2_MASK      ((uint32_t)0x00000400u)
#define MPU_RASR3_R_SRD2_BIT       (10u)
#define MPU_RASR3_R_SRD2_EN           ((uint32_t)0x00000000u)
#define MPU_RASR3_R_SRD2_DIS       ((uint32_t)0x00000400u)

#define MPU_RASR3_SRD2_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR3_SRD2_EN          ((uint32_t)0x00000000u)
#define MPU_RASR3_SRD2_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD3_MASK      ((uint32_t)0x00000800u)
#define MPU_RASR3_R_SRD3_BIT       (11u)
#define MPU_RASR3_R_SRD3_EN           ((uint32_t)0x00000000u)
#define MPU_RASR3_R_SRD3_DIS       ((uint32_t)0x00000800u)

#define MPU_RASR3_SRD3_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR3_SRD3_EN          ((uint32_t)0x00000000u)
#define MPU_RASR3_SRD3_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD4_MASK      ((uint32_t)0x00001000u)
#define MPU_RASR3_R_SRD4_BIT       (12u)
#define MPU_RASR3_R_SRD4_EN           ((uint32_t)0x00000000u)
#define MPU_RASR3_R_SRD4_DIS       ((uint32_t)0x00001000u)

#define MPU_RASR3_SRD4_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR3_SRD4_EN          ((uint32_t)0x00000000u)
#define MPU_RASR3_SRD4_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD5_MASK      ((uint32_t)0x00002000u)
#define MPU_RASR3_R_SRD5_BIT       (13u)
#define MPU_RASR3_R_SRD5_EN           ((uint32_t)0x00000000u)
#define MPU_RASR3_R_SRD5_DIS       ((uint32_t)0x00002000u)

#define MPU_RASR3_SRD5_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR3_SRD5_EN          ((uint32_t)0x00000000u)
#define MPU_RASR3_SRD5_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD6_MASK      ((uint32_t)0x00004000u)
#define MPU_RASR3_R_SRD6_BIT       (14u)
#define MPU_RASR3_R_SRD6_EN           ((uint32_t)0x00000000u)
#define MPU_RASR3_R_SRD6_DIS       ((uint32_t)0x00004000u)

#define MPU_RASR3_SRD6_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR3_SRD6_EN          ((uint32_t)0x00000000u)
#define MPU_RASR3_SRD6_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_SRD7_MASK      ((uint32_t)0x00008000u)
#define MPU_RASR3_R_SRD7_BIT       (15u)
#define MPU_RASR3_R_SRD7_EN           ((uint32_t)0x00000000u)
#define MPU_RASR3_R_SRD7_DIS       ((uint32_t)0x00008000u)

#define MPU_RASR3_SRD7_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR3_SRD7_EN          ((uint32_t)0x00000000u)
#define MPU_RASR3_SRD7_DIS         ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_B_MASK      ((uint32_t)0x00010000u)
#define MPU_RASR3_R_B_BIT       (16u)
#define MPU_RASR3_R_B_DIS       ((uint32_t)0x00000000u)
#define MPU_RASR3_R_B_EN        ((uint32_t)0x00010000u)

#define MPU_RASR3_B_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR3_B_DIS         ((uint32_t)0x00000000u)
#define MPU_RASR3_B_EN          ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_C_MASK      ((uint32_t)0x00020000u)
#define MPU_RASR3_R_C_BIT       (17u)
#define MPU_RASR3_R_C_DIS       ((uint32_t)0x00000000u)
#define MPU_RASR3_R_C_EN        ((uint32_t)0x00020000u)

#define MPU_RASR3_C_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR3_C_DIS         ((uint32_t)0x00000000u)
#define MPU_RASR3_C_EN          ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_S_MASK      ((uint32_t)0x00040000u)
#define MPU_RASR3_R_S_BIT       (18u)
#define MPU_RASR3_R_S_DIS       ((uint32_t)0x00000000u)
#define MPU_RASR3_R_S_EN        ((uint32_t)0x00040000u)

