InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/Core/MPU/Header/Peripheral/Register/MPU_RegisterDefines.h
#define MPU_RASR3_S_MASK        ((uint32_t)0x00000001u)
#define MPU_RASR3_S_DIS         ((uint32_t)0x00000000u)
#define MPU_RASR3_S_EN          ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_TEX_MASK      ((uint32_t)0x00380000u)
#define MPU_RASR3_R_TEX_BIT       (19u)
#define MPU_RASR3_R_TEX_NC        ((uint32_t)0x00000000u)
#define MPU_RASR3_R_TEX_WB_WRA    ((uint32_t)0x00080000u)
#define MPU_RASR3_R_TEX_WT_NWA    ((uint32_t)0x00100000u)
#define MPU_RASR3_R_TEX_WB_NWA    ((uint32_t)0x00180000u)

#define MPU_RASR3_TEX_MASK        ((uint32_t)0x00000007u)
#define MPU_RASR3_TEX_NC          ((uint32_t)0x00000000u)
#define MPU_RASR3_TEX_WB_WRA      ((uint32_t)0x00000001u)
#define MPU_RASR3_TEX_WT_NWA      ((uint32_t)0x00000002u)
#define MPU_RASR3_TEX_WB_NWA      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_AP_MASK      ((uint32_t)0x07000000u)
#define MPU_RASR3_R_AP_BIT       (24u)
#define MPU_RASR3_R_AP_NANA      ((uint32_t)0x00000000u)
#define MPU_RASR3_R_AP_RWNA      ((uint32_t)0x01000000u)
#define MPU_RASR3_R_AP_RWRO      ((uint32_t)0x02000000u)
#define MPU_RASR3_R_AP_RWRW      ((uint32_t)0x03000000u)
#define MPU_RASR3_R_AP_RONA      ((uint32_t)0x05000000u)
#define MPU_RASR3_R_AP_RORO      ((uint32_t)0x06000000u)

#define MPU_RASR3_AP_MASK      ((uint32_t)0x00000007u)
#define MPU_RASR3_AP_NANA      ((uint32_t)0x00000000u)
#define MPU_RASR3_AP_RWNA      ((uint32_t)0x00000001u)
#define MPU_RASR3_AP_RWRO      ((uint32_t)0x00000002u)
#define MPU_RASR3_AP_RWRW      ((uint32_t)0x00000003u)
#define MPU_RASR3_AP_RONA      ((uint32_t)0x00000005u)
#define MPU_RASR3_AP_RORO      ((uint32_t)0x00000006u)
/*--------*/

/*--------*/
#define MPU_RASR3_R_XN_MASK      ((uint32_t)0x10000000u)
#define MPU_RASR3_R_XN_BIT       (28u)
#define MPU_RASR3_R_XN_DIS       ((uint32_t)0x00000000u)
#define MPU_RASR3_R_XN_EN        ((uint32_t)0x10000000u)

#define MPU_RASR3_XN_MASK       ((uint32_t)0x00000001u)
#define MPU_RASR3_XN_DIS        ((uint32_t)0x00000000u)
#define MPU_RASR3_XN_EN         ((uint32_t)0x00000001u)
/*--------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_MPU_PERIPHERAL_REGISTER_MPU_REGISTERDEFINES_H_ */
